1750=enochs=and=washington__colonial_draft_genealogy.org
#+title:      A Back Road To Cumberland
#+subtitle: Washington, Braddock and our trips to 'The Burgh'
#+date:       [2026-03-12 Thu 16:40]
#+Author: George Morrison Jones
#+signature:  1750=enochs=and=washington
#+email: gmj@pobox.com
#+filetags:   :colonial:draft:genealogy:public:
#+identifier: 20260312T164052
#+BIBLIOGRAPHY: family.bib
#+cite_export: csl chicago-fullnote-bibliography.csl
#+OPTIONS: author:t date:t email:t toc:1
#+OPTIONS: html-postamble:nil
#+BIBLIOGRAPHY: family.bib
#+OPTIONS: author:t date:t 
#+OPTIONS: html-postamble:nil
#+LATEX_COMPILER: pdflatex
#+LATEX_HEADER: \usepackage{pmboxdraw}
#+LATEX_HEADER: \usepackage{titling}
#+LATEX_HEADER: \preauthor{\begin{center}\large}
#+LATEX_HEADER: \postauthor{\par\normalsize gmj@pobox.com\end{center}}
#+OPTIONS: email:nil
#+latex_class: article
#+latex_class_options: [titlepage]
#+MACRO: conditional-title (eval (if (org-export-derived-backend-p org-export-current-backend 'latex) "#+OPTIONS: title:t" "#+OPTIONS: title:nil"))
#+last_saved: 2026-03-16 13:50
#+last_saved: 2026-03-16 13:51
#+last_saved: 2026-03-16 13:52
#+last_saved: 2026-03-16 13:54
#+last_saved: 2026-03-16 13:54
#+last_saved: 2026-03-16 13:54
#+last_saved: 2026-03-16 13:59
#+last_saved: 2026-03-16 13:59
#+last_saved: 2026-03-16 13:59
#+last_saved: 2026-04-16 08:39










{{{conditional-title}}}

#+last_saved: 2026-03-16 13:38
* We found a shortcut

When we moved from Ohio to Virginia in 2003 we were making frequent trips to Pittsburgh (as Washington did)
and Ohio to see relatives.   We discovered a "back way" through the little towns of Bloomery and Paw Paw, (now) West Virginia
that involves a shortcut across a one-lane bridge on Gaston Road.   It turns out shortcut was on land that Washington himself
surveyed for Henry Enochs Sr. in 1750.  It was Washington's preferred route to Cumberland, MD, which was the staging
point for both his ill-fated Fort Necessity mis-adventure and his later mis-adventures with General Braddock.
Washington recommended the construction of ?2? forts on Enoch's property during the subsequent French and Indian
War when it became the front line of the conflict.   Washington recorded in his diary dining at Enochs
as late as 1770.  During the revolution "Capitan" Henry Enochs Jr and Enoch Enochs both enlisted.

I'm not going to trace the whole line here, but our Morrison line  traces back to the Enochs.

Below I list

 - Timelines of
   + Washington's mis-adventures at Ft. Necessity
   + Washington's mis-adventures with Braddock
   + The defensive scramble after Braddock's defeat centered on the Enochs property documented in primary sources (see APPENDIX)
 - A summary of the Enochs/Washington Relationship by "the AIs" (trust or not, you choose) 
 - A summary of genealogical information about Enoch Enochs (my 4xGreat Grandfather).  Washington surveyed land for him as well as his father.
 - Primary sources from the national Archives (Washington's diaries, etc)

* Timelines
** 1753-1754 Fort Necessity Timeline
Timeline of Events Leading to and Including the Battle of Fort Necessity

| Date                             | Event                                                                                                                                                      |
|----------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 1753                             | Young George Washington delivers British ultimatum to French, demanding they evacuate the Ohio Territory (Allegheny Expedition)                            |
| March 15, 1754                   | Governor Robert Dinwiddie orders Washington to depart with 160 men to build a road and defend British interests                                            |
| Spring 1754                      | Washington establishes Fort Necessity at Great Meadows after finding French already occupying Wills Creek                                                  |
| May 1754                         | Seneca leader Tanacharison informs Washington of a small French force camped six miles away                                                                |
| May 1754                         | Washington attacks French forces at Jumonville Glen under cover of darkness; French Ensign Jumonville is killed, 10 French soldiers die, 21 taken prisoner |
| May-July 1754                    | Washington fortifies Fort Necessity in anticipation of French retaliation                                                                                  |
| July 3, 1754 (Morning)           | French force of 500 men and 100 Native American allies appear at Fort Necessity's tree line                                                                |
| July 3, 1754 (Afternoon-Evening) | Standoff battle occurs in torrential downpour with heavy casualties on both sides                                                                          |
| July 3, 1754 (Late Evening)      | Washington surrenders Fort Necessity; unwittingly acknowledges role in Jumonville's assassination                                                          |
| July 4, 1754                     | Washington's depleted force departs Fort Necessity in defeat                                                                                               |

Summarized from:
https://www.mountvernon.org/library/digitalhistory/digital-encyclopedia/article/fort-necessity

** 1755 Braddock Timeline
*** Timeline form Primary Sources
Braddock's defeat; the journal of Captain Robert Cholmley's batman, the journal of a British officer [and] Halkett's orderly book
https://archive.org/details/braddocksdefeatj00hami

#+begin_verse
As shown in Capt. Cholmley’s Batman (Dunbar’s Regiment):
May 5, Monday marched to Henry Enoch’s
July 9 Battle
July 13, Sunday Braddock dies in the evening
July 14, Monday march a short distance and bury Gen. Braddock; marched on
August 4, marched to Enoch’s
 
As shown in Halkett’s Orderly Book
(note orders are usually for the next day)
May 8-10 dated the waters of Cape Capon
May 11 dated camp betwixt Enoxes & Coves
July 9 Battle
#+end_verse
*** Timeline from Secondary Sources
Fort Edwards was another in the line of forts that Washington recommended be built along with Fort Enochs.
Fort Edwards has been reconstructed.   There is a Fort Edwards Foundation that promotes it.
See this link https://www.fortedwards.org/braddock/timeline.htm for their timeline of the Braddock expedition
and other related history.
