1750=enochs=and=washington__colonial_draft_genealogy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-16 Mon 14:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Back Road To Cumberland</title>
<meta name="author" content="George Morrison Jones" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<h1 class="title">A Back Road To Cumberland</h1>
          <p class="subtitle">Washington, Braddock and our trips to 'The Burgh'</p>
          <br>
          <p class="subtitle">George Morrison Jones</p>
          <p class="subtitle"><a href="mailto:gmj@pobox.com">gmj@pobox.com</a></p>
          <p class="subtitle">2026-03-12 Thu 16:40</p>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8ed7a90">1. We found a shortcut</a></li>
<li><a href="#org9c3da7e">2. Timelines</a></li>
<li><a href="#org02aaaa1">3. Washington and Enochs - What the AIs think</a></li>
<li><a href="#orgf5a2cd1">4. Enoch Enochs (1750–~1835) - Summary</a></li>
<li><a href="#org616066c">5. APPENDIX - Primary Sources - References from the National Archives and other sources</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8ed7a90" class="outline-2">
<h2 id="org8ed7a90"><span class="section-number-2">1.</span> We found a shortcut</h2>
<div class="outline-text-2" id="text-1">
<p>
When we moved from Ohio to Virginia in 2003 we were making frequent trips to Pittsburgh (as Washington did)
and Ohio to see relatives.   We discovered a "back way" through the little towns of Bloomery and Paw Paw, (now) West Virginia
that involves a shortcut across a one-lane bridge on Gaston Road.   It turns out shortcut was on land that Washington himself
surveyed for Henry Enochs Sr. in 1750.  It was Washington's preferred route to Cumberland, MD, which was the staging
point for both his ill-fated Fort Necessity mis-adventure and his later mis-adventures with General Braddock.
Washington recommended the construction of ?2? forts on Enoch's property during the subsequent French and Indian
War when it became the front line of the conflict.   Washington recorded in his diary dining at Enochs
as late as 1770.  During the revolution "Capitan" Henry Enochs Jr and Enoch Enochs both enlisted.
</p>

<p>
I'm not going to trace the whole line here, but our Morrison line  traces back to the Enochs.
</p>

<p>
Below I list
</p>

<ul class="org-ul">
<li>Timelines of
<ul class="org-ul">
<li>Washington's mis-adventures at Ft. Necessity</li>
<li>Washington's mis-adventures with Braddock</li>
<li>The defensive scramble after Braddock's defeat centered on the Enochs property documented in primary sources (see APPENDIX)</li>
</ul></li>
<li>A summary of the Enochs/Washington Relationship by "the AIs" (trust or not, you choose)</li>
<li>A summary of genealogical information about Enoch Enochs (my 4xGreat Grandfather).  Washington surveyed land for him as well as his father.</li>
<li>Primary sources from the national Archives (Washington's diaries, etc)</li>
</ul>
</div>
</div>
<div id="outline-container-org9c3da7e" class="outline-2">
<h2 id="org9c3da7e"><span class="section-number-2">2.</span> Timelines</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org32c2c6a" class="outline-3">
<h3 id="org32c2c6a"><span class="section-number-3">2.1.</span> 1753-1754 Fort Necessity Timeline</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Timeline of Events Leading to and Including the Battle of Fort Necessity
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Event</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1753</td>
<td class="org-left">Young George Washington delivers British ultimatum to French, demanding they evacuate the Ohio Territory (Allegheny Expedition)</td>
</tr>

<tr>
<td class="org-left">March 15, 1754</td>
<td class="org-left">Governor Robert Dinwiddie orders Washington to depart with 160 men to build a road and defend British interests</td>
</tr>

<tr>
<td class="org-left">Spring 1754</td>
<td class="org-left">Washington establishes Fort Necessity at Great Meadows after finding French already occupying Wills Creek</td>
</tr>

<tr>
<td class="org-left">May 1754</td>
<td class="org-left">Seneca leader Tanacharison informs Washington of a small French force camped six miles away</td>
</tr>

<tr>
<td class="org-left">May 1754</td>
<td class="org-left">Washington attacks French forces at Jumonville Glen under cover of darkness; French Ensign Jumonville is killed, 10 French soldiers die, 21 taken prisoner</td>
</tr>

<tr>
<td class="org-left">May-July 1754</td>
<td class="org-left">Washington fortifies Fort Necessity in anticipation of French retaliation</td>
</tr>

<tr>
<td class="org-left">July 3, 1754 (Morning)</td>
<td class="org-left">French force of 500 men and 100 Native American allies appear at Fort Necessity's tree line</td>
</tr>

<tr>
<td class="org-left">July 3, 1754 (Afternoon-Evening)</td>
<td class="org-left">Standoff battle occurs in torrential downpour with heavy casualties on both sides</td>
</tr>

<tr>
<td class="org-left">July 3, 1754 (Late Evening)</td>
<td class="org-left">Washington surrenders Fort Necessity; unwittingly acknowledges role in Jumonville's assassination</td>
</tr>

<tr>
<td class="org-left">July 4, 1754</td>
<td class="org-left">Washington's depleted force departs Fort Necessity in defeat</td>
</tr>
</tbody>
</table>

<p>
Summarized from:
<a href="https://www.mountvernon.org/library/digitalhistory/digital-encyclopedia/article/fort-necessity">https://www.mountvernon.org/library/digitalhistory/digital-encyclopedia/article/fort-necessity</a>
</p>
</div>
</div>
<div id="outline-container-org0196595" class="outline-3">
<h3 id="org0196595"><span class="section-number-3">2.2.</span> 1755 Braddock Timeline</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org3a2fb1e" class="outline-4">
<h4 id="org3a2fb1e"><span class="section-number-4">2.2.1.</span> Timeline form Primary Sources</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Braddock's defeat; the journal of Captain Robert Cholmley's batman, the journal of a British officer [and] Halkett's orderly book
<a href="https://archive.org/details/braddocksdefeatj00hami">https://archive.org/details/braddocksdefeatj00hami</a>
</p>

<p class="verse">
As shown in Capt. Cholmley’s Batman (Dunbar’s Regiment):<br />
May 5, Monday marched to Henry Enoch’s<br />
July 9 Battle<br />
July 13, Sunday Braddock dies in the evening<br />
July 14, Monday march a short distance and bury Gen. Braddock; marched on<br />
August 4, marched to Enoch’s<br />
<br />
As shown in Halkett’s Orderly Book<br />
(note orders are usually for the next day)<br />
May 8-10 dated the waters of Cape Capon<br />
May 11 dated camp betwixt Enoxes &amp; Coves<br />
July 9 Battle<br />
</p>
</div>
</div>
<div id="outline-container-orge257eeb" class="outline-4">
<h4 id="orge257eeb"><span class="section-number-4">2.2.2.</span> Timeline from Secondary Sources</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Fort Edwards was another in the line of forts that Washington recommended be built along with Fort Enochs.
Fort Edwards has been reconstructed.   There is a Fort Edwards Foundation that promotes it.
See this link <a href="https://www.fortedwards.org/braddock/timeline.htm">https://www.fortedwards.org/braddock/timeline.htm</a> for their timeline of the Braddock expedition
and other related history.
</p>
</div>
</div>
</div>
