1750=enochs=and=washington__colonial_draft_genealogy.html
<div id="outline-container-orgd600f8b" class="outline-3">
<h3 id="orgd600f8b"><span class="section-number-3">2.3.</span> Post-Braddock Timeline: The Enochs Property and Washington's Frontier Defense</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Based on the primary sources below, here is a chronological timeline of events following Braddock's defeat in July 1755:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Event</th>
<th scope="col" class="org-left">Source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>July 9, 1755</b></td>
<td class="org-left">Braddock's defeat at the Battle of the Monongahela</td>
<td class="org-left">Braddock's Defeat journal</td>
</tr>

<tr>
<td class="org-left"><b>July 13, 1755</b></td>
<td class="org-left">General Braddock dies</td>
<td class="org-left">Braddock's Defeat journal</td>
</tr>

<tr>
<td class="org-left"><b>August 4, 1755</b></td>
<td class="org-left">Retreating army marches to Enoch's</td>
<td class="org-left">Capt. Cholmley's Batman</td>
</tr>

<tr>
<td class="org-left"><b>October 6, 1755</b></td>
<td class="org-left">Washington issues march orders; troops to arrive at Henry Enocks on October 23rd</td>
<td class="org-left">Orders, 6 October 1755</td>
</tr>

<tr>
<td class="org-left"><b>November 7, 1755</b></td>
<td class="org-left">Adam Stephen reports stationing a party at Henry Enoch's on Cape Capon to prevent settlers from abandoning the valley; recommends party at Enoch's as part of frontier defense</td>
<td class="org-left">Stephen to Washington</td>
</tr>

<tr>
<td class="org-left"><b>November 22, 1755</b></td>
<td class="org-left">Stephen reports 17 men + 1 sergeant stationed at "Enock's Mill"</td>
<td class="org-left">Stephen to Washington</td>
</tr>

<tr>
<td class="org-left"><b>March 2, 1756</b></td>
<td class="org-left">Robert Orme references "the Palace of Enoch Enoch's" where Braddock's staff had stopped</td>
<td class="org-left">Orme to Washington</td>
</tr>

<tr>
<td class="org-left"><b>April 7, 1756</b></td>
<td class="org-left">Washington orders Lt. Blagg to maintain communication with Ensign Hubbard at Enochs</td>
<td class="org-left">Washington to Blagg</td>
</tr>

<tr>
<td class="org-left"><b>April 21, 1756</b></td>
<td class="org-left">Washington writes to Capt. Harrison about potentially aiding Hubbard's retreat from Enochs</td>
<td class="org-left">Washington to Harrison</td>
</tr>

<tr>
<td class="org-left"><b>April 23, 1756</b></td>
<td class="org-left">Council of War unanimously decides Fort Enochs should be "immediately evacuated and burnt" to prevent enemy use</td>
<td class="org-left">Council of War</td>
</tr>

<tr>
<td class="org-left"><b>April 23, 1756</b></td>
<td class="org-left">Washington orders Ensign Hubbard to evacuate and destroy the fort at Enochs</td>
<td class="org-left">Washington to Hubbard</td>
</tr>

<tr>
<td class="org-left"><b>May 11, 1756</b></td>
<td class="org-left">Reports of Indians seen on road between Winchester and Enock's</td>
<td class="org-left">Orders, 11 May 1756</td>
</tr>

<tr>
<td class="org-left"><b>May 15, 1756</b></td>
<td class="org-left">Despite earlier evacuation order, militia posted to Enock's: Lt. Bebb with 2 sergeants and 35 men from Louisa</td>
<td class="org-left">Orders for Militia</td>
</tr>

<tr>
<td class="org-left"><b>May 16, 1756</b></td>
<td class="org-left">Orders given to Lt. Bebb at Henry Enocks's</td>
<td class="org-left">Memoranda</td>
</tr>

<tr>
<td class="org-left"><b>July 10, 1756</b></td>
<td class="org-left">Council of War discusses building chain of forts; decides second fort should be built "at or near to Henry Enocks's plantation on great capecapon"</td>
<td class="org-left">Council of War</td>
</tr>

<tr>
<td class="org-left"><b>October 8, 1770</b></td>
<td class="org-left">Washington passes through, notes "the Fort at Henry Enochs" is 8 miles from Pritchards (road "exceedg. bad")</td>
<td class="org-left">Diary entry</td>
</tr>

<tr>
<td class="org-left"><b>November 28, 1770</b></td>
<td class="org-left">Washington dines at "Henry Enochs at the Fork of Cacapehon"</td>
<td class="org-left">Diary entry</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org02aaaa1" class="outline-2">
<h2 id="org02aaaa1"><span class="section-number-2">3.</span> Washington and Enochs - What the AIs think</h2>
<div class="outline-text-2" id="text-3">
<p>
This is an AI (Claude) summary of the primary sources above:
</p>

<p>
PROMPT:  Given the information below,  Describe the relationship between George Washington and The Enochs Family.
</p>

<p>
Based on the primary sources in this document, George Washington had a <b>professional and strategic relationship</b> with the Enochs family spanning over two decades, primarily through three contexts:
</p>
</div>
<div id="outline-container-orgdeeed6d" class="outline-4">
<h4 id="orgdeeed6d"><span class="section-number-4">3.0.1.</span> 1. Surveyor-Client Relationship (1749-1753)</h4>
<div class="outline-text-4" id="text-3-0-1">
<p>
Washington professionally surveyed lands for the Enochs family:
</p>
<ul class="org-ul">
<li><b>April 1750</b>: Surveyed 388 acres for <b>Henry Enoch</b> at the fork of Cacapon and North rivers</li>
<li><b>April 1751</b>: Surveyed 168 acres for <b>Enoch Enoch</b> on the Potomac River</li>
<li>An undated survey of 271½ acres on Little Cacapon River for Henry Enoch</li>
</ul>
</div>
</div>
<div id="outline-container-org1eb967c" class="outline-4">
<h4 id="org1eb967c"><span class="section-number-4">3.0.2.</span> 2. Military Logistics During the French and Indian War (1755-1756)</h4>
<div class="outline-text-4" id="text-3-0-2">
<p>
Henry Enoch's property served as a <b>critical waypoint</b> on Braddock's Road:
</p>
<ul class="org-ul">
<li><b>May 1755</b>: Braddock's troops marched through, stopping at "Henry Enoch's"</li>
<li><b>August 1755</b>: The retreating army returned via Enoch's after Braddock's defeat</li>
<li>Washington's march routes in October 1755 included Enoch's as a designated stop</li>
</ul>

<p>
<b>Enoch's Fort</b> became a key defensive position:
</p>
<ul class="org-ul">
<li>Washington stationed troops there (17 men + 1 sergeant in November 1755)</li>
<li>Ordered its evacuation and burning in April 1756 during Indian raids</li>
<li>Later recommended rebuilding it as part of a chain of frontier forts</li>
</ul>
</div>
</div>
<div id="outline-container-org07e4ffe" class="outline-4">
<h4 id="org07e4ffe"><span class="section-number-4">3.0.3.</span> 3. Continued Familiarity (1770)</h4>
<div class="outline-text-4" id="text-3-0-3">
<p>
Washington's diary entries show he still knew the location well, dining at "Henry Enochs at the Fork of Cacapehon" during his 1770 western journey.
</p>

<p>
The relationship was fundamentally *utilitarian*—the Enochs' strategic location made them essential to Virginia's frontier defense.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf5a2cd1" class="outline-2">
<h2 id="orgf5a2cd1"><span class="section-number-2">4.</span> Enoch Enochs (1750–~1835) - Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
This is a summary of information collected by John Bowdle about Enoch Enochs.
</p>

<p>
<b>Revolutionary War Patriot</b> who served as Captain in the Pennsylvania/Virginia frontier forces, enlisting in 1774 under his brother Colonel Henry Enochs.
</p>

<p>
<b>Key highlights:</b>
</p>
<ul class="org-ul">
<li>Born in Hampshire County, VA (now WV); died in what became Noble County, OH</li>
<li>Part of a prominent frontier family — described as "Buckskin era" settlers of German extraction</li>
<li>Military service spanning the Indian Wars, Revolutionary War, and War of 1812</li>
<li>The Enochs family were early settlers of Noble County, OH, along with connected families: Crows, Grandons, Morris's, and Archers</li>
<li>Family noted as Methodist, politically Whig/Republican</li>
<li>Buried at Archer Cemetery, Noble County, OH</li>
</ul>

<p>
<b>DAR documented</b> — National Number 895450, Pension R3357v
</p>
</div>
</div>
<div id="outline-container-org616066c" class="outline-2">
<h2 id="org616066c"><span class="section-number-2">5.</span> APPENDIX - Primary Sources - References from the National Archives and other sources</h2>
<div class="outline-text-2" id="text-5">
</div>
