1750=enochs=and=washington__colonial_draft_genealogy.org
** George Washington’s Professional Surveys, 1749-1752
  https://founders.archives.gov/documents/Washington/02-01-02-0004
  #+begin_quote
  23 April 1750. For Henry Enoch. 388 acres at the fork of Cacapon and North rivers. Granted to Henry Enoch, 22 April 1753.
  24 April 1751. For Enoch Enoch. 168 acres on Potomac River. Granted to Enoch Enoch, 3 September 1753.
  Undated Surveys Cited in Northern Neck Grants
  No date. 271½ acres on Little Cacapon River. Granted to Henry Enoch, 20 February 1761.
  #+end_quote

  Cite as
  “George Washington’s Professional Surveys,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-01-02-0004. [Original source: The Papers of George Washington, Colonial Series, vol. 1, 7 July 1748 – 14 August 1755, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 8–37.]

** Orders, 6 October 1755
https://founders.archives.gov/documents/Washington/02-02-02-0070
  #+begin_quote
  Orders
  [Fredericksburg, 6 October 1755]
  As Captain George Mercer of the Virginia Forces, has been appointed aide de camp to Colonel Washington, and declared in Publick Orders at Fort Cumberland ...
  A Detachment of ... under the Command of Captain Woodward, are to march on Monday next, for Fort-Cumberland,1 and to proceed according to the following March Route: viz.
  
  Monday, October the	13	th	To William Pickets
  ...
  15		To Joseph Nevils [NOTE: Near where I (George Jones) Live today 2026]
  ...
  23		To Henry Enocks
  #+end_quote

  Cite as
  “Orders, 6 October 1755,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-02-02-0070. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 75–77.]
  
** Adam Stephen to George Washington, 7 November 1755
https://founders.archives.gov/documents/Washington/02-02-02-0163  
  #+begin_quote
  Adam Stephen to George Washington, 7 November 1755
  From Adam Stephen
  Winchester Novr 7th 1755Sir,
  ... I have found it necessary, to prevent the people from Abandoning This Valley on this Side the blue Ridge, to Send a party of men to Henry Enoch’s on Cape Capo...
  
  If a party is not Stationed on Cape Capo, The Enemy may come within four miles of Winchester before they are heard of, and indeed to Secure that Frontier properly Maryland ought to have 100 men at Cressops, 100 at the Conallaways—wt. a party at the Mouth of Little Cape Capo, another at Enoch’s,
  #+end_quote

  Cite as
  “Adam Stephen to George Washington, 7 November 1755,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-02-02-0163. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 158–162.]
  
** Adam Stephen to George Washington, 22 November 1755
https://founders.archives.gov/documents/Washington/02-02-02-0182
*** Excerpt
#+begin_quote
Adam Stephen to George Washington, 22 November 1755
From Adam Stephen
Winchester Novr 22d 1755Dr Sir,
... 
. The State of Your Regimt in these parts, is nearly this

At Fort Cumbld Effectives: pt. 280 & 40 Serjeants a great Number of Corps.

At Enock’s Mill.        pt.     17      1 Serjt

Adam Stephen

ALS, DLC:GW.


CITE AS
“Adam Stephen to George Washington, 22 November 1755,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-02-02-0182. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 177–179.]
#+end_quote

[2026-03-12 Thu 15:35]

** Robert Orme to George Washington, 2 March 1756
  https://founders.archives.gov/documents/Washington/02-02-02-0319
  #+begin_quote
  Dr George March the 2d 1756
  ...
  
  I dont know whether a good House and comfortable Living is not as well as the Palace of Enoch Enoch’s.5
   
  Robt Orme
  #+end_quote
  
  #+begin_quote
  ALS, DLC:GW.
  
  5. General Braddock and his staff had probably stopped at the home of Enoch Enoch, just east of the Cacapon River in Hampshire County, on their way to join the troops at Cresap’s.
  #+end_quote

  
Cite as
“Robert Orme to George Washington, 2 March 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-02-02-0319. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 320–322.]

** George Washington to John Blagg, 7 April 1756
https://founders.archives.gov/documents/Washington/02-02-02-0331
#+begin_quote
To John Blagg
[Winchester, 7 April 1756]To Lieutenant Blagg, of the Virginia Regiment.

You are to endeavour to keep a communication open with Ensign Hubbard at Enochs; 

LB, DLC:GW.

John Blagg was at this time the lieutenant of Capt. John Savage’s 6th company of the Virginia Regiment.

1. See GW’s Orders, 7 April 1756. Joseph Edwards’s fortified house, or fort, was west of Winchester on the Cacapon River, upstream from Henry Enoch’s fort to the north of it.

2. Ens. Edward Hubbard of Charles Lewis’s company in the Virginia Regiment was on detached duty at Enoch’s. The copyist spelled “Above” as “Alove.”
#+end_quote

Cite as
“George Washington to John Blagg, 7 April 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-02-02-0331. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, p. 332.]
** George Washington to Henry Harrison, 21 April 1756
https://founders.archives.gov/documents/Washington/02-03-02-0029

:PROPERTIES:
:URL: https://founders.archives.gov/?q=Enocks&s=1111311111&sa=&r=5&sr=
:END:

