1750=enochs=and=washington__colonial_draft_genealogy.html
<div id="outline-container-org39e49a6" class="outline-3">
<h3 id="org39e49a6"><span class="section-number-3">5.1.</span> George Washington’s Professional Surveys, 1749-1752</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-01-02-0004">https://founders.archives.gov/documents/Washington/02-01-02-0004</a>
</p>
<blockquote>
<p>
23 April 1750. For Henry Enoch. 388 acres at the fork of Cacapon and North rivers. Granted to Henry Enoch, 22 April 1753.
24 April 1751. For Enoch Enoch. 168 acres on Potomac River. Granted to Enoch Enoch, 3 September 1753.
Undated Surveys Cited in Northern Neck Grants
No date. 271½ acres on Little Cacapon River. Granted to Henry Enoch, 20 February 1761.
</p>
</blockquote>

<p>
Cite as
“George Washington’s Professional Surveys,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-01-02-0004">https://founders.archives.gov/documents/Washington/02-01-02-0004</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 1, 7 July 1748 – 14 August 1755, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 8–37.]
</p>
</div>
</div>
<div id="outline-container-org2d5ca62" class="outline-3">
<h3 id="org2d5ca62"><span class="section-number-3">5.2.</span> Orders, 6 October 1755</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-02-02-0070">https://founders.archives.gov/documents/Washington/02-02-02-0070</a>
</p>
<blockquote>
<p>
Orders
[Fredericksburg, 6 October 1755]
As Captain George Mercer of the Virginia Forces, has been appointed aide de camp to Colonel Washington, and declared in Publick Orders at Fort Cumberland &#x2026;
A Detachment of &#x2026; under the Command of Captain Woodward, are to march on Monday next, for Fort-Cumberland,1 and to proceed according to the following March Route: viz.
</p>

<p>
Monday, October the	13	th	To William Pickets
&#x2026;
15		To Joseph Nevils [NOTE: Near where I (George Jones) Live today 2026]
&#x2026;
23		To Henry Enocks
</p>
</blockquote>

<p>
Cite as
“Orders, 6 October 1755,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-02-02-0070">https://founders.archives.gov/documents/Washington/02-02-02-0070</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 75–77.]
</p>
</div>
</div>
<div id="outline-container-org493f9da" class="outline-3">
<h3 id="org493f9da"><span class="section-number-3">5.3.</span> Adam Stephen to George Washington, 7 November 1755</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-02-02-0163">https://founders.archives.gov/documents/Washington/02-02-02-0163</a>  
</p>
<blockquote>
<p>
Adam Stephen to George Washington, 7 November 1755
From Adam Stephen
Winchester Novr 7th 1755Sir,
&#x2026; I have found it necessary, to prevent the people from Abandoning This Valley on this Side the blue Ridge, to Send a party of men to Henry Enoch’s on Cape Capo&#x2026;
</p>

<p>
If a party is not Stationed on Cape Capo, The Enemy may come within four miles of Winchester before they are heard of, and indeed to Secure that Frontier properly Maryland ought to have 100 men at Cressops, 100 at the Conallaways—wt. a party at the Mouth of Little Cape Capo, another at Enoch’s,
</p>
</blockquote>

<p>
Cite as
“Adam Stephen to George Washington, 7 November 1755,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-02-02-0163">https://founders.archives.gov/documents/Washington/02-02-02-0163</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 158–162.]
</p>
</div>
</div>
<div id="outline-container-orgee3689a" class="outline-3">
<h3 id="orgee3689a"><span class="section-number-3">5.4.</span> Adam Stephen to George Washington, 22 November 1755</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-02-02-0182">https://founders.archives.gov/documents/Washington/02-02-02-0182</a>
</p>
</div>
<div id="outline-container-orgf9994c2" class="outline-4">
<h4 id="orgf9994c2"><span class="section-number-4">5.4.1.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-4-1">
<blockquote>
<p>
Adam Stephen to George Washington, 22 November 1755
From Adam Stephen
Winchester Novr 22d 1755Dr Sir,
&#x2026; 
. The State of Your Regimt in these parts, is nearly this
</p>

<p>
At Fort Cumbld Effectives: pt. 280 &amp; 40 Serjeants a great Number of Corps.
</p>

<p>
At Enock’s Mill.        pt.     17      1 Serjt
</p>

<p>
Adam Stephen
</p>

<p>
ALS, DLC:GW.
</p>


<p>
CITE AS
“Adam Stephen to George Washington, 22 November 1755,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-02-02-0182">https://founders.archives.gov/documents/Washington/02-02-02-0182</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 177–179.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 15:35]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-org253d686" class="outline-3">
<h3 id="org253d686"><span class="section-number-3">5.5.</span> Robert Orme to George Washington, 2 March 1756</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-02-02-0319">https://founders.archives.gov/documents/Washington/02-02-02-0319</a>
</p>
<blockquote>
<p>
Dr George March the 2d 1756
&#x2026;
</p>

<p>
I dont know whether a good House and comfortable Living is not as well as the Palace of Enoch Enoch’s.5
</p>

<p>
Robt Orme
</p>
</blockquote>

<blockquote>
<p>
ALS, DLC:GW.
</p>

<ol class="org-ol">
<li>General Braddock and his staff had probably stopped at the home of Enoch Enoch, just east of the Cacapon River in Hampshire County, on their way to join the troops at Cresap’s.</li>
</ol>
</blockquote>


<p>
Cite as
“Robert Orme to George Washington, 2 March 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-02-02-0319">https://founders.archives.gov/documents/Washington/02-02-02-0319</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, pp. 320–322.]
</p>
</div>
</div>
<div id="outline-container-org0a1e90b" class="outline-3">
<h3 id="org0a1e90b"><span class="section-number-3">5.6.</span> George Washington to John Blagg, 7 April 1756</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-02-02-0331">https://founders.archives.gov/documents/Washington/02-02-02-0331</a>
</p>
<blockquote>
<p>
To John Blagg
[Winchester, 7 April 1756]To Lieutenant Blagg, of the Virginia Regiment.
</p>

<p>
You are to endeavour to keep a communication open with Ensign Hubbard at Enochs; 
</p>

<p>
LB, DLC:GW.
</p>

<p>
John Blagg was at this time the lieutenant of Capt. John Savage’s 6th company of the Virginia Regiment.
</p>

<ol class="org-ol">
<li>See GW’s Orders, 7 April 1756. Joseph Edwards’s fortified house, or fort, was west of Winchester on the Cacapon River, upstream from Henry Enoch’s fort to the north of it.</li>

<li>Ens. Edward Hubbard of Charles Lewis’s company in the Virginia Regiment was on detached duty at Enoch’s. The copyist spelled “Above” as “Alove.”</li>
</ol>
</blockquote>

<p>
Cite as
“George Washington to John Blagg, 7 April 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-02-02-0331">https://founders.archives.gov/documents/Washington/02-02-02-0331</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 2, 14 August 1755 – 15 April 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1983, p. 332.]
</p>
</div>
</div>
<div id="outline-container-orgca375b8" class="outline-3">
<h3 id="orgca375b8"><span class="section-number-3">5.7.</span> George Washington to Henry Harrison, 21 April 1756</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0029">https://founders.archives.gov/documents/Washington/02-03-02-0029</a>
</p>

<p>
:URL: <a href="https://founders.archives.gov/?q=Enocks&amp;s=1111311111&amp;sa=&amp;r=5&amp;sr">https://founders.archives.gov/?q=Enocks&amp;s=1111311111&amp;sa=&amp;r=5&amp;sr</a>=
</p>
</div>
