1750=enochs=and=washington__colonial_draft_genealogy.org
*** Excerpt
#+begin_quote
George Washington to Henry Harrison, 21 April 1756
To Henry Harrison
[Winchester, 21 April 1756]To Captain Harrison, Commanding at Edwards’s.
Sir,
It is out of my power at this juncture to supply you with any Provision. Therefore I would have you apply to Edwards, to whom I write. Acquaint him, that whatever he expends, he shall receive a reasonable satisfaction for: and hint to him, that without his compliance the Garrison now there, must depart to this place. You are likewise ordered (on Mr Hubbard, at Enocks, signifying his want of assistance in aiding his retreat to your Fort) to supply him with at least fifty of your Garrison, who will Escort that under his command to your place, where he is ordered. Dispatch the enclosed letter,1 on arrival, by Express. I am &c.

G:W.

April 21st 1756.
LB, DLC:GW.

1. This was probably GW’s letter of this date to Edward Hubbard at Enoch’s fort.


CITE AS
“George Washington to Henry Harrison, 21 April 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0029. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 29.]
#+end_quote

[2026-03-12 Thu 16:11]

** Council of War, 23 April 1756
https://founders.archives.gov/documents/Washington/02-03-02-0039


*** Notes
Apparent decision to abandon and burn Enock's fort
*** Excerpt
#+begin_quote
Council of War, 23 April 1756
Council of War
At a Council of War, Held at Winchester, April 23d 1756

Colonel George Washington, President.
Present, Governor James Innis–
Captain Mercer                          
Captain Peachy  Members Captain Stewart
Lieutenant Eustace      Lieutenant Hall
Lieutenant Gist         Lieutenant Lowry
Colonel Washington asked the opinion of the Council, whether it was most elligible to evacuate the small Stockade at Enocks’s, and draw all the men out of Edwards’s, except so many as were absolutely necessary for the defence of that place, and order them to join us here; as having a few men scattered in so many places can not answer the original intention of that disposition: vizt Protecting that part of the Country, which is now abandoned by the Inhabitants, and we at the same time deprived of the aid we would receive, by bringing those who garrison it here. And as, without an immediate reinforcement here, it is impracticable either to send a supply of Provisions to Edwards’s, or to open a communication to Conogochieg, from whence only we can hope for getting Provisions even for the few men in these Quarters: And as the few men at Enocks’s and Edwards’s, can only act upon the defensive and can not hold out for want of Provisions—If it would not be better for them to escort the few Inhabitants now under their protection, to the interior part of the Settlement where they can be supplied with Provisions; and by that reinforcement, we be enabled to open a communication with Conogochieg—or wait the uncertain arrival of the militia for their Relief.

It is the unanimous opinion of the Council, that Enocks’s Fort should be immediately evacuated and burnt; to prevent its being of service to the Enemy: That its Garrison, and all that can be spared from Edwards’s, do join us with the utmost expedition; bringing such of the Inhabitants under their escort, as chuse to come.

The opinion of the Council was likewise asked, whether it was most advisable for the Sergeants Command to be ordered to retreat, or to maintain that trifling Stockade.1 It is unanimously agreed, that as there are no late accounts from thence, consequently can not so well judge of their circumstances; and as giving an absolute Order either to stay or move, might produce their ruin—That a Discretionary Power should be sent them, either to stay or retreat, as to them might appear most safe.

LB, DLC:GW.

1. The “trifling Stockade” was probably Horner’s (Homer’s) fort. See GW to Henry Harrison, 20 April 1756, n.2.


CITE AS
“Council of War, 23 April 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0039. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, pp. 38–39.]
#+end_quote

[2026-03-12 Thu 16:18]

** George Washington to Edward Hubbard, 23 April 1756
https://founders.archives.gov/documents/Washington/02-03-02-0041

:PROPERTIES:
:URL: https://founders.archives.gov/?q=Enocks&s=1111311111&sa=&r=7&sr=
:END:

*** Excerpt
#+begin_quote
George Washington to Edward Hubbard, 23 April 1756
To Edward Hubbard
[Winchester, 23 April 1756]To Ensign Hubbard. commanding at Enocks’s Fort.
Sir,
It has been determind here in a Council of War, that it would be most advisable for you to evacuate your Fort at Enocks’s; destroy it, and join Captain Harrison at Edwards’s, with your party, stores, and the inhabitants. As we are not acquainted with their situation at Cox’s, it was thought best that you should send the Sergeant there, a conditional order to join you at Enocks’s, or keep possession where he is (whichever he and the Inhabitants, from the situation of affairs, think most advisable;) until we can send them some assistance, which will, I hope, be very soon; as I expect to be joined by a number of men shortly.

You are to send him this order immediately. If he retreats to your party, you must order him to destroy the Fort, ere he quits the place.

I would recommend it to the Inhabitants, to drive down their Cattle, &c. with them. Yours

G:W.

April 23, 1756.
LB, DLC:GW.


Reference
CITE AS
“George Washington to Edward Hubbard, 23 April 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0041. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 41.]
#+end_quote

[2026-03-12 Thu 15:30]

** Orders, 11 May 1756
https://founders.archives.gov/documents/Washington/02-03-02-0111

