1750=enochs=and=washington__colonial_draft_genealogy.html
<div id="outline-container-orgf29a7fc" class="outline-4">
<h4 id="orgf29a7fc"><span class="section-number-4">5.7.1.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-7-1">
<blockquote>
<p>
George Washington to Henry Harrison, 21 April 1756
To Henry Harrison
[Winchester, 21 April 1756]To Captain Harrison, Commanding at Edwards’s.
Sir,
It is out of my power at this juncture to supply you with any Provision. Therefore I would have you apply to Edwards, to whom I write. Acquaint him, that whatever he expends, he shall receive a reasonable satisfaction for: and hint to him, that without his compliance the Garrison now there, must depart to this place. You are likewise ordered (on Mr Hubbard, at Enocks, signifying his want of assistance in aiding his retreat to your Fort) to supply him with at least fifty of your Garrison, who will Escort that under his command to your place, where he is ordered. Dispatch the enclosed letter,1 on arrival, by Express. I am &amp;c.
</p>

<p>
G:W.
</p>

<p>
April 21st 1756.
LB, DLC:GW.
</p>

<p>
1. This was probably GW’s letter of this date to Edward Hubbard at Enoch’s fort.
</p>


<p>
CITE AS
“George Washington to Henry Harrison, 21 April 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0029">https://founders.archives.gov/documents/Washington/02-03-02-0029</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 29.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 16:11]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-orga81adbc" class="outline-3">
<h3 id="orga81adbc"><span class="section-number-3">5.8.</span> Council of War, 23 April 1756</h3>
<div class="outline-text-3" id="text-5-8">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0039">https://founders.archives.gov/documents/Washington/02-03-02-0039</a>
</p>
</div>
<div id="outline-container-orgc77cd3a" class="outline-4">
<h4 id="orgc77cd3a"><span class="section-number-4">5.8.1.</span> Notes</h4>
<div class="outline-text-4" id="text-5-8-1">
<p>
Apparent decision to abandon and burn Enock's fort
</p>
</div>
</div>
<div id="outline-container-org9669b17" class="outline-4">
<h4 id="org9669b17"><span class="section-number-4">5.8.2.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-8-2">
<blockquote>
<p>
Council of War, 23 April 1756
Council of War
At a Council of War, Held at Winchester, April 23d 1756
</p>

<p>
Colonel George Washington, President.
Present, Governor James Innis–
Captain Mercer                          
Captain Peachy  Members Captain Stewart
Lieutenant Eustace      Lieutenant Hall
Lieutenant Gist         Lieutenant Lowry
Colonel Washington asked the opinion of the Council, whether it was most elligible to evacuate the small Stockade at Enocks’s, and draw all the men out of Edwards’s, except so many as were absolutely necessary for the defence of that place, and order them to join us here; as having a few men scattered in so many places can not answer the original intention of that disposition: vizt Protecting that part of the Country, which is now abandoned by the Inhabitants, and we at the same time deprived of the aid we would receive, by bringing those who garrison it here. And as, without an immediate reinforcement here, it is impracticable either to send a supply of Provisions to Edwards’s, or to open a communication to Conogochieg, from whence only we can hope for getting Provisions even for the few men in these Quarters: And as the few men at Enocks’s and Edwards’s, can only act upon the defensive and can not hold out for want of Provisions—If it would not be better for them to escort the few Inhabitants now under their protection, to the interior part of the Settlement where they can be supplied with Provisions; and by that reinforcement, we be enabled to open a communication with Conogochieg—or wait the uncertain arrival of the militia for their Relief.
</p>

<p>
It is the unanimous opinion of the Council, that Enocks’s Fort should be immediately evacuated and burnt; to prevent its being of service to the Enemy: That its Garrison, and all that can be spared from Edwards’s, do join us with the utmost expedition; bringing such of the Inhabitants under their escort, as chuse to come.
</p>

<p>
The opinion of the Council was likewise asked, whether it was most advisable for the Sergeants Command to be ordered to retreat, or to maintain that trifling Stockade.1 It is unanimously agreed, that as there are no late accounts from thence, consequently can not so well judge of their circumstances; and as giving an absolute Order either to stay or move, might produce their ruin—That a Discretionary Power should be sent them, either to stay or retreat, as to them might appear most safe.
</p>

<p>
LB, DLC:GW.
</p>

<p>
1. The “trifling Stockade” was probably Horner’s (Homer’s) fort. See GW to Henry Harrison, 20 April 1756, n.2.
</p>


<p>
CITE AS
“Council of War, 23 April 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0039">https://founders.archives.gov/documents/Washington/02-03-02-0039</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, pp. 38–39.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 16:18]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-orga2f65b1" class="outline-3">
<h3 id="orga2f65b1"><span class="section-number-3">5.9.</span> George Washington to Edward Hubbard, 23 April 1756</h3>
<div class="outline-text-3" id="text-5-9">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0041">https://founders.archives.gov/documents/Washington/02-03-02-0041</a>
</p>

<p>
:URL: <a href="https://founders.archives.gov/?q=Enocks&amp;s=1111311111&amp;sa=&amp;r=7&amp;sr">https://founders.archives.gov/?q=Enocks&amp;s=1111311111&amp;sa=&amp;r=7&amp;sr</a>=
</p>
</div>
<div id="outline-container-org39ec002" class="outline-4">
<h4 id="org39ec002"><span class="section-number-4">5.9.1.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-9-1">
<blockquote>
<p>
George Washington to Edward Hubbard, 23 April 1756
To Edward Hubbard
[Winchester, 23 April 1756]To Ensign Hubbard. commanding at Enocks’s Fort.
Sir,
It has been determind here in a Council of War, that it would be most advisable for you to evacuate your Fort at Enocks’s; destroy it, and join Captain Harrison at Edwards’s, with your party, stores, and the inhabitants. As we are not acquainted with their situation at Cox’s, it was thought best that you should send the Sergeant there, a conditional order to join you at Enocks’s, or keep possession where he is (whichever he and the Inhabitants, from the situation of affairs, think most advisable;) until we can send them some assistance, which will, I hope, be very soon; as I expect to be joined by a number of men shortly.
</p>

<p>
You are to send him this order immediately. If he retreats to your party, you must order him to destroy the Fort, ere he quits the place.
</p>

<p>
I would recommend it to the Inhabitants, to drive down their Cattle, &amp;c. with them. Yours
</p>

<p>
G:W.
</p>

<p>
April 23, 1756.
LB, DLC:GW.
</p>


<p>
Reference
CITE AS
“George Washington to Edward Hubbard, 23 April 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0041">https://founders.archives.gov/documents/Washington/02-03-02-0041</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 41.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 15:30]</span></span>
</p>
</div>
</div>
</div>
