1750=enochs=and=washington__colonial_draft_genealogy.org
*** Excerpt
#+begin_quote
Orders, 11 May 1756
Orders
Parole: London.

Winchester: Tuesday, May 11th [1756]
As there is a Report, that some Indians have been seen on the road between this and Enock’s

...

LB, DLC:GW.


CITE AS
“Orders, 11 May 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0111. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 118.]
#+end_quote

[2026-03-12 Thu 16:26]

** Orders for the Militia, 15 May 1756
https://founders.archives.gov/documents/Washington/02-03-02-0132

*** Notes
Fort not destroyed?
*** Excerpt
#+begin_quote
Orders for the Militia, 15 May 1756
Orders for the Militia
[Winchester, 15 May 1756]
Orders for the Militia.

...
In consequence of the council of War that was held the 14th instant: Such part of the Militia of the several counties as rendezvous’d at this place, and were detained here; are ordered to be posted as follows vizt.1

At Enock’s—Lieutenant Bebb, with two Sergeants, and thirty-five private men, from Louisa.


CITE AS
“Orders for the Militia, 15 May 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0132. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, pp. 136–137.]
#+end_quote

[2026-03-12 Thu 16:30]

** Memoranda, 16 May 1756
https://founders.archives.gov/documents/Washington/02-03-02-0143

*** Excerpt
#+begin_quote
Memoranda, 16 May 1756
Memoranda
[Winchester, 16 May 1756]
...
A copy of these orders also given to Lieutenant Bebb, of the Louisa Militia; who was ordered to Henry Enocks’s.2

LB, DLC:GW.

2. Lt. Thomas Bibb was first lieutenant in Capt. Joseph Fox’s company of volunteer rangers from Louisa County in 1755.


CITE AS
“Memoranda, 16 May 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0143. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 145.]
#+end_quote

[2026-03-12 Thu 16:35]
** Council of War, 10 July 1756
https://founders.archives.gov/documents/Washington/02-03-02-0235

*** Notes
Building a ?New? ?2nd? fort at Enocks?
*** Excerpt
#+begin_quote
Council of War, 10 July 1756
Council of War
A Council of War, Held at Fort-Cumberland, July 10th 1756.
Colonel George Washington—President.
... 
The President having informed the council that the General Assembly had resolved upon building a chain of Forts for the protection of the Frontiers—To begin at Henry Enocks’s, on Great Capecapon, and extend in the most convenient line to Mayo-river the building of which forts was not to exceed two thousand pounds1—and as the fixing upon the places judiciously was a matter of great importance to the country—He desired their advice thereupon: and put the following Questions—First Whether it was advisable to begin the said chain of forts at Henry Enocks’s on great capecapon?

The council was unanimous in opinion that it was not—Because, as the Province of Maryland had abandoned their Settlements on potowmack to a great distance it left a fertile and populous district, from that down to Maidstone, at Watkins’s Ferry, exposed to incursions of the Enemy; and to which there lead several warrior paths from Raystown and Susquehannah, much frequented by the Indians.

...
Thirdly: Where ought the second Fort to be built? The Council having considered the situation of the country and the Body of Inhabitants to be defended, are of opinion, that at or near to Henry Enocks’s plantation on great capecapon, is the most advisable place to build the second fort on.

It defends the inhabitants on the waters of capecapon—is contiguous to the Settlements on the heads of the waters of sleepy and back-creeks: and maintains the communication with the Forts on Patterson’s-creek, &c.

Fifthly: Is it then necessary to have a fort between that at Enocks and Ashby’s?

...

The Forts built by Captain Waggener have had the desired effect—The inhabitants of that fertile district, keep possession of their Farms; and seem resolved to pursue their Business under cover of them.

LB, DLC:GW. GW later enclosed a copy of these minutes of the council of war in his letter to Dinwiddie, 4 Aug. 1756.

2. The mouth of Sleepy Creek at the Potomac River was well to the north and east of Henry Enoch’s place on the Cacapon River. 

3.... A portion of the road from the South Branch to Enoch’s—that part between the Little Cacapon and Enoch’s—probably corresponded with the road built for Braddock’s troops in 1755. See GW to Henry Woodward, 4 May 1756, n.1.


CITE AS
“Council of War, 10 July 1756,” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/02-03-02-0235. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, pp. 243–246.]
#+end_quote

[2026-03-12 Thu 15:55]

