1750=enochs=and=washington__colonial_draft_genealogy.html
<div id="outline-container-org9e17640" class="outline-3">
<h3 id="org9e17640"><span class="section-number-3">5.10.</span> Orders, 11 May 1756</h3>
<div class="outline-text-3" id="text-5-10">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0111">https://founders.archives.gov/documents/Washington/02-03-02-0111</a>
</p>
</div>
<div id="outline-container-org2a800e4" class="outline-4">
<h4 id="org2a800e4"><span class="section-number-4">5.10.1.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-10-1">
<blockquote>
<p>
Orders, 11 May 1756
Orders
Parole: London.
</p>

<p>
Winchester: Tuesday, May 11th [1756]
As there is a Report, that some Indians have been seen on the road between this and Enock’s
</p>

<p>
&#x2026;
</p>

<p>
LB, DLC:GW.
</p>


<p>
CITE AS
“Orders, 11 May 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0111">https://founders.archives.gov/documents/Washington/02-03-02-0111</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 118.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 16:26]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-org065c626" class="outline-3">
<h3 id="org065c626"><span class="section-number-3">5.11.</span> Orders for the Militia, 15 May 1756</h3>
<div class="outline-text-3" id="text-5-11">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0132">https://founders.archives.gov/documents/Washington/02-03-02-0132</a>
</p>
</div>
<div id="outline-container-org0ceaabb" class="outline-4">
<h4 id="org0ceaabb"><span class="section-number-4">5.11.1.</span> Notes</h4>
<div class="outline-text-4" id="text-5-11-1">
<p>
Fort not destroyed?
</p>
</div>
</div>
<div id="outline-container-orgf52b669" class="outline-4">
<h4 id="orgf52b669"><span class="section-number-4">5.11.2.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-11-2">
<blockquote>
<p>
Orders for the Militia, 15 May 1756
Orders for the Militia
[Winchester, 15 May 1756]
Orders for the Militia.
</p>

<p>
&#x2026;
In consequence of the council of War that was held the 14th instant: Such part of the Militia of the several counties as rendezvous’d at this place, and were detained here; are ordered to be posted as follows vizt.1
</p>

<p>
At Enock’s—Lieutenant Bebb, with two Sergeants, and thirty-five private men, from Louisa.
</p>


<p>
CITE AS
“Orders for the Militia, 15 May 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0132">https://founders.archives.gov/documents/Washington/02-03-02-0132</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, pp. 136–137.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 16:30]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-org3e7b381" class="outline-3">
<h3 id="org3e7b381"><span class="section-number-3">5.12.</span> Memoranda, 16 May 1756</h3>
<div class="outline-text-3" id="text-5-12">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0143">https://founders.archives.gov/documents/Washington/02-03-02-0143</a>
</p>
</div>
<div id="outline-container-org6c8c39c" class="outline-4">
<h4 id="org6c8c39c"><span class="section-number-4">5.12.1.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-12-1">
<blockquote>
<p>
Memoranda, 16 May 1756
Memoranda
[Winchester, 16 May 1756]
&#x2026;
A copy of these orders also given to Lieutenant Bebb, of the Louisa Militia; who was ordered to Henry Enocks’s.2
</p>

<p>
LB, DLC:GW.
</p>

<p>
2. Lt. Thomas Bibb was first lieutenant in Capt. Joseph Fox’s company of volunteer rangers from Louisa County in 1755.
</p>


<p>
CITE AS
“Memoranda, 16 May 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0143">https://founders.archives.gov/documents/Washington/02-03-02-0143</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, p. 145.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 16:35]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-org01d687a" class="outline-3">
<h3 id="org01d687a"><span class="section-number-3">5.13.</span> Council of War, 10 July 1756</h3>
<div class="outline-text-3" id="text-5-13">
<p>
<a href="https://founders.archives.gov/documents/Washington/02-03-02-0235">https://founders.archives.gov/documents/Washington/02-03-02-0235</a>
</p>
</div>
<div id="outline-container-org99c4663" class="outline-4">
<h4 id="org99c4663"><span class="section-number-4">5.13.1.</span> Notes</h4>
<div class="outline-text-4" id="text-5-13-1">
<p>
Building a ?New? ?2nd? fort at Enocks?
</p>
</div>
</div>
<div id="outline-container-orgcc58ee7" class="outline-4">
<h4 id="orgcc58ee7"><span class="section-number-4">5.13.2.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-13-2">
<blockquote>
<p>
Council of War, 10 July 1756
Council of War
A Council of War, Held at Fort-Cumberland, July 10th 1756.
Colonel George Washington—President.
&#x2026; 
The President having informed the council that the General Assembly had resolved upon building a chain of Forts for the protection of the Frontiers—To begin at Henry Enocks’s, on Great Capecapon, and extend in the most convenient line to Mayo-river the building of which forts was not to exceed two thousand pounds1—and as the fixing upon the places judiciously was a matter of great importance to the country—He desired their advice thereupon: and put the following Questions—First Whether it was advisable to begin the said chain of forts at Henry Enocks’s on great capecapon?
</p>

<p>
The council was unanimous in opinion that it was not—Because, as the Province of Maryland had abandoned their Settlements on potowmack to a great distance it left a fertile and populous district, from that down to Maidstone, at Watkins’s Ferry, exposed to incursions of the Enemy; and to which there lead several warrior paths from Raystown and Susquehannah, much frequented by the Indians.
</p>

<p>
&#x2026;
Thirdly: Where ought the second Fort to be built? The Council having considered the situation of the country and the Body of Inhabitants to be defended, are of opinion, that at or near to Henry Enocks’s plantation on great capecapon, is the most advisable place to build the second fort on.
</p>

<p>
It defends the inhabitants on the waters of capecapon—is contiguous to the Settlements on the heads of the waters of sleepy and back-creeks: and maintains the communication with the Forts on Patterson’s-creek, &amp;c.
</p>

<p>
Fifthly: Is it then necessary to have a fort between that at Enocks and Ashby’s?
</p>

<p>
&#x2026;
</p>

<p>
The Forts built by Captain Waggener have had the desired effect—The inhabitants of that fertile district, keep possession of their Farms; and seem resolved to pursue their Business under cover of them.
</p>

<p>
LB, DLC:GW. GW later enclosed a copy of these minutes of the council of war in his letter to Dinwiddie, 4 Aug. 1756.
</p>

<p>
2. The mouth of Sleepy Creek at the Potomac River was well to the north and east of Henry Enoch’s place on the Cacapon River. 
</p>

<p>
3&#x2026;. A portion of the road from the South Branch to Enoch’s—that part between the Little Cacapon and Enoch’s—probably corresponded with the road built for Braddock’s troops in 1755. See GW to Henry Woodward, 4 May 1756, n.1.
</p>


<p>
CITE AS
“Council of War, 10 July 1756,” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/02-03-02-0235">https://founders.archives.gov/documents/Washington/02-03-02-0235</a>. [Original source: The Papers of George Washington, Colonial Series, vol. 3, 16 April 1756–9 November 1756, ed. W. W. Abbot. Charlottesville: University Press of Virginia, 1984, pp. 243–246.]
</p>
</blockquote>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2026-03-12 Thu 15:55]</span></span>
</p>
</div>
</div>
</div>
