1750=enochs=and=washington__colonial_draft_genealogy.org
** Diary entry: 8 October 1770
https://founders.archives.gov/documents/Washington/01-02-02-0005-0029-0004
- 1770, 8 Oct, Diary Entry :: National archives GW diary entry 8 Oct 1770 
  [Diary entry: 8 October 1770]
  #+begin_quote
  ...The distance from Pritchards to Cresaps according to Computation is 26 Miles, thus reckond; to the Fort at Henry Enochs2 8 Miles (road exceedg. bad) 12 to Cox’s3 at the Mouth of little Cacapehon and 6 afterwards.
  #+end_quote
  
   ...
  #+begin_quote
  2. Henry Enoch had received a grant on 22 April 1753 for 388 acres on Cacapon River based on a survey done for him by GW in 1750. He received a further grant of 271½ acres in Hampshire County in 1761 (Northern Neck Deeds and Grants, Book H, 280, Book K, 228, Vi Microfilm). See also keith [1]. Enoch’s fort, erected after Braddock’s Defeat, was built at the forks of the Great Cacapon River, on the road from Winchester in what is now Hampshire County, W.Va. GW had suggested the fort on a list of frontier defenses drawn up in 1756 (DLC:GW).
  #+end_quote

  “[Diary entry: 8 October 1770],” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/01-02-02-0005-0029-0004. [Original source: The Diaries of George Washington, vol. 2, 14 January 1766 – 31 December 1770, ed. Donald Jackson. Charlottesville: University Press of Virginia, 1976, pp. 287–288.]
  
** Diary entry: 28 November 1770
https://founders.archives.gov/documents/Washington/01-02-02-0005-0031-0009

*** Excerpt
#+begin_quote
[Diary entry: 28 November 1770]
Wednesday 28th. The Old Town Gut was so high as to Wet us in crossing it, and when we came to Coxs., the River was Impassable; we were obligd therefore to cross in a Canoe & swim our Horses. At Henry Enochs at the Fork of Cacapehon we dind, & lodgd at Rinkers. The distances thus computed—from the old Town to Coxs. 8 Miles—from thence to Cacapehon 12 and 18 Afterwards in all 38 Miles. The last 18 I do not think long ones.


CITE AS
“[Diary entry: 28 November 1770],” Founders Online, National Archives, https://founders.archives.gov/documents/Washington/01-02-02-0005-0031-0009. [Original source: The Diaries of George Washington, vol. 2, 14 January 1766 – 31 December 1770, ed. Donald Jackson. Charlottesville: University Press of Virginia, 1976, p. 324.]
#+end_quote


- Search for enoch :: https://founders.archives.gov/?q=Enochs%20Period%3A%22Colonial%22&s=1111211111&sa=&r=1&sr=


From the primary sources, give me a timeline post Braddock

