1750=enochs=and=washington__colonial_draft_genealogy.html
<div id="outline-container-orgef28620" class="outline-3">
<h3 id="orgef28620"><span class="section-number-3">5.14.</span> Diary entry: 8 October 1770</h3>
<div class="outline-text-3" id="text-5-14">
<p>
<a href="https://founders.archives.gov/documents/Washington/01-02-02-0005-0029-0004">https://founders.archives.gov/documents/Washington/01-02-02-0005-0029-0004</a>
</p>
<dl class="org-dl">
<dt>1770, 8 Oct, Diary Entry</dt><dd><p>
National archives GW diary entry 8 Oct 1770 
[Diary entry: 8 October 1770]
</p>
<blockquote>
<p>
&#x2026;The distance from Pritchards to Cresaps according to Computation is 26 Miles, thus reckond; to the Fort at Henry Enochs2 8 Miles (road exceedg. bad) 12 to Cox’s3 at the Mouth of little Cacapehon and 6 afterwards.
</p>
</blockquote>

<p>
&#x2026;
</p>
<blockquote>
<ol class="org-ol">
<li>Henry Enoch had received a grant on 22 April 1753 for 388 acres on Cacapon River based on a survey done for him by GW in 1750. He received a further grant of 271½ acres in Hampshire County in 1761 (Northern Neck Deeds and Grants, Book H, 280, Book K, 228, Vi Microfilm). See also keith [1]. Enoch’s fort, erected after Braddock’s Defeat, was built at the forks of the Great Cacapon River, on the road from Winchester in what is now Hampshire County, W.Va. GW had suggested the fort on a list of frontier defenses drawn up in 1756 (DLC:GW).</li>
</ol>
</blockquote>

<p>
“[Diary entry: 8 October 1770],” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/01-02-02-0005-0029-0004">https://founders.archives.gov/documents/Washington/01-02-02-0005-0029-0004</a>. [Original source: The Diaries of George Washington, vol. 2, 14 January 1766 – 31 December 1770, ed. Donald Jackson. Charlottesville: University Press of Virginia, 1976, pp. 287–288.]
</p></dd>
</dl>
</div>
</div>
<div id="outline-container-org31bb581" class="outline-3">
<h3 id="org31bb581"><span class="section-number-3">5.15.</span> Diary entry: 28 November 1770</h3>
<div class="outline-text-3" id="text-5-15">
<p>
<a href="https://founders.archives.gov/documents/Washington/01-02-02-0005-0031-0009">https://founders.archives.gov/documents/Washington/01-02-02-0005-0031-0009</a>
</p>
</div>
<div id="outline-container-orgd423ed3" class="outline-4">
<h4 id="orgd423ed3"><span class="section-number-4">5.15.1.</span> Excerpt</h4>
<div class="outline-text-4" id="text-5-15-1">
<blockquote>
<p>
[Diary entry: 28 November 1770]
Wednesday 28th. The Old Town Gut was so high as to Wet us in crossing it, and when we came to Coxs., the River was Impassable; we were obligd therefore to cross in a Canoe &amp; swim our Horses. At Henry Enochs at the Fork of Cacapehon we dind, &amp; lodgd at Rinkers. The distances thus computed—from the old Town to Coxs. 8 Miles—from thence to Cacapehon 12 and 18 Afterwards in all 38 Miles. The last 18 I do not think long ones.
</p>


<p>
CITE AS
“[Diary entry: 28 November 1770],” Founders Online, National Archives, <a href="https://founders.archives.gov/documents/Washington/01-02-02-0005-0031-0009">https://founders.archives.gov/documents/Washington/01-02-02-0005-0031-0009</a>. [Original source: The Diaries of George Washington, vol. 2, 14 January 1766 – 31 December 1770, ed. Donald Jackson. Charlottesville: University Press of Virginia, 1976, p. 324.]
</p>
</blockquote>


<dl class="org-dl">
<dt>Search for enoch</dt><dd><a href="https://founders.archives.gov/?q=Enochs%20Period%3A%22Colonial%22&amp;s=1111211111&amp;sa=&amp;r=1&amp;sr">https://founders.archives.gov/?q=Enochs%20Period%3A%22Colonial%22&amp;s=1111211111&amp;sa=&amp;r=1&amp;sr</a>=</dd>
</dl>


<p>
From the primary sources, give me a timeline post Braddock
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
